# Инвариантная самостоятельная работа

### [1.1. Создание простейшего сценария по выводу текста на экран](https://repl.it/@PolinaLazebniko/Tema1-ISR-Zad11)
```python
"""
    Лазебникова Полина 
    ИВТ 2 курс
    группа 1.1

    Инвариантная самостоятельная работа 
    Задание 1.1: Создание простейшей сценария по выводу текста на экран.
"""

print('Hello, World!')
```
### [1.2. Разработка скрипта, вычисляющего сумму первых n-членов арифметической прогрессии](https://repl.it/@PolinaLazebniko/Tema1-ISR-Zad12)
```python
"""
    Лазебникова Полина 
    ИВТ 2 курс
    группа 1.1

    Инвариантная самостоятельная работа 
    Задание 1.2: Разработка скрипта, вычисляющего сумму первых n-членов арифметической прогрессии
    (использование функций, условных операторов).
"""

def summ(a1, d, n):
    """
    Функция для вычисления суммы первых n-членов арифметической прогрессии

    Входные данные - первый член арифметической прогрессии, номер последнего члена, разность членов
    Выходные данные - сумма первых n-членов арифметической прогрессии 

    Проверяет, если номер последнего члена не равен одному, тогда высчитывает сумму первых n-членов 
    арифметической прогрессии по формуле, иначе эта сумма равна первому члену прогрессии 
    """
    if n != 1: 
        sn = n * (2 * a1 + (n - 1) * d) / 2
    else:    
        sn = a1
    return sn
    
def main():
    """
    Функция, которая принимает от пользователя 3 параметра выводит результат вызова к функции summ 
    """
    a1 = int(input("Введите первый член арифметической прогрессии: "))
    n = int(input("введите номер последнего члена: "))
    d = int(input("Введите разность членов: "))
    print("Сумма: ", summ(a1, d, n))
    
main()
```
### [1.3. Разработка скрипта, позволяющего вычислить площадь треугольника с помощью формулы Герона](https://repl.it/@PolinaLazebniko/Geron)
```python
"""
    Лазебникова Полина 
    ИВТ 2 курс
    группа 1.1

    Инвариантная самостоятельная работа 
    Задание 1.3: вычисление площади треугольника по формуле Герона
"""

import math

def geron_sq(a, b, c):
    """
    Функция для вычисления площади треугольника

    Входные данные - стороны треугольника
    Выходные данные - площадь треугольника 

    Выводит на экран значение площади, записанной в переменной geron. Также рассчитывает для формулы
    Герона полупериметр треугольника (переменная p).
    """ 	  
    p = (a + b + c) / 2
    geron = math.sqrt(p * (p - a) * (p - b) * (p - c));
    return geron

def main():
    """
    Функция, которая принимает от пользователя 3 стороны треугольника, проверяет существование треугольника,
    и если он существует, то выводит результат обращения к функции geron_sq 
    """
    a = int(input("Введите a: "))
    b = int(input("Введите b: "))
    c = int(input("Введите c: "))
    if (a + b < c) or (a + c < b) or (b + c < a):
        print("Треугольник не существует")
    else:
        print("Площадь треугольника:", geron_sq(a, b, c))

main()
```
### [1.4. Создание сценария, вычисляющего операции сложения, вычитания, умножения, деления для двух операндов](https://repl.it/@PolinaLazebniko/Tema1-ISR-Zad14)
```python
"""
    Лазебникова Полина 
    ИВТ 2 курс
    группа 1.1

    Инвариантная самостоятельная работа 
    Задание 1.4: Создание сценария, вычисляющего операции сложения, вычитания, умножения, деления
    для двух операндов. 
"""

def main():
    """
    Функция, которая принимает от пользователя 2 числа. Далее предоставляет выбор, какую операцию выполнить. 
    """
    a = int(input("Введите первое число a: "))
    b = int(input("Введите второе число b: "))
    
    choice = None
    while choice != '5':

        print('1 - сложение')
        print('2 - вычитание')
        print('3 - умножение')
        print('4 - деление')
        print('5 - для выхода')
        choice = input("Выберите операцию (1..5) ")
        
        if choice == '1':
            print("Сумма чисел a+b равна ", a + b)
        if choice == '2':
            print("Разность чисел a-b равна ", a - b)
            print("Разность чисел b-a равна ", b - a)
        if choice == '3':
            print("Произведение чисел a*b равно ", a * b)
        if choice == '4':
            print("Частное чисел a/b равно ", a / b)
            print("Частное чисел b/a равно ", b / a)
           
main()
```
# Вариативная самостоятельная работа

### 1.1 Создание ЭОР на тему «Развертывание и настройка среды для разработки на Python»
