# Вариативная самостоятельная работа

### [2.1. Исследование способов преобразования программного кода Python в соответствии со стандартом PEP8. Составить сравнительную таблицу с анализом.](https://www.dropbox.com/s/6ztypdwqbm6cjj6/%D0%9B%D0%B0%D0%B7%D0%B5%D0%B1%D0%BD%D0%B8%D0%BA%D0%BE%D0%B2%D0%B0%20%D0%9F%D0%BE%D0%BB%D0%B8%D0%BD%D0%B0%20%D0%98%D0%92%D0%A2%201.1%20%D0%92%D0%A1%D0%A0%202.1.docx?dl=0)
[Ссылка](https://www.dropbox.com/s/6ztypdwqbm6cjj6/%D0%9B%D0%B0%D0%B7%D0%B5%D0%B1%D0%BD%D0%B8%D0%BA%D0%BE%D0%B2%D0%B0%20%D0%9F%D0%BE%D0%BB%D0%B8%D0%BD%D0%B0%20%D0%98%D0%92%D0%A2%201.1%20%D0%92%D0%A1%D0%A0%202.1.docx?dl=0)
### [2.4. Разработка программы, которая для заданного количества значений возвращала бы список из повторяющихся элементов, содержащихся во входном наборе значений. ](https://repl.it/@PolinaLazebniko/Tema5-VSR-Zad22)
```python
"""
    Лазебникова Полина 
    ИВТ 2 курс
    группа 1.1

    Вариативная самостоятельная работа 
    Задание 2.2: Разработать программу, которая для заданного количества значений возвращала бы список из 
    повторяющихся элементов, содержащихся во входном наборе значений. Использовать упаковку и распаковку
    элементов.
"""

def repeating_element(*args):
    """    
    Функция для нахождения повторяющихся элементов, содержащихся во входном наборе значений

    Входные данные - набор значений
    Выходные данные - повторяющиеся элементы

    Находит все повторяющиеся значений и добавляет их в конец списка, далее с помощью множества 
    делает так, чтобы значения не повторялись, и возвращает список повторяющихся элементов    
    """
    repeat_arr = []
    for i in range(len(args)):
        for j in range(len(args)):
            if args[i] == args[j] and i != j:
                repeat_arr.append(args[i])
    repeat_arr = list(set(repeat_arr))
    
    return repeat_arr

print(repeating_element(8, 1, 1, 'b', 8, 3, 5, 8, 9, 'a', 'a', 9))
```
### [2.6. Лямбда-функцию, генерирующую квадраты чисел из переменной типа list, через генератор списка.](https://repl.it/@PolinaLazebniko/Tema5-VSR-Zad23)
```python
"""
    Лазебникова Полина 
    ИВТ 2 курс
    группа 1.1

    Вариативная самостоятельная работа

    Задание 2.3: Перепишите лямбда-функцию, генерирующую квадраты чисел из переменной
    типа list, через генератор списка.
"""

a = [i for i in range(1,11)]
print (list(map(lambda x: x*x, a)))
```
